import { Book } from "./definitions"

enum CategoryTypes {
	Book = "كتاب",
	Article = "مقال",
	All = "كل الاصناف",
}

export const categories: string[] = [
	CategoryTypes.All,
	CategoryTypes.Book,
	CategoryTypes.Article,
]

export const books: Book[] = [
	{
		id: 0,
		isbn: "",
		categoryId: categories.indexOf(CategoryTypes.Book),
		coverImageUrl:
			"/books/covers/معجم اعراب الفاظ الصحيفة السجادية محمد جليل عباس - الجزء الاول.jpg",
		title: "مُعْجَمُ إعرابَ ألفاظِ الصَّحيفةِ السَّجاديَّةِ - الجزء الاول",
		slug: "mujam-irab-alfaz-alsahifa-alsajjadya-part-1",
		author: "محمد جليل عباس",
		editors: [
			"سلمان محمد عبد السيد - إشراف",
			"د. علي حسن الدلفي - إشراف",
			"حسن سويدان - إخراج فني",
		],
		description:
			"هذا الكتاب يعتبر معجمًا شاملاً لإعراب الكلمات في الصحيفة السجادية، وهي مجموعة من الأدعية والأقوال التي يُنسبها الشيعة إلى الإمام علي بن الحسين، المعروف أيضًا باسم الإمام السجاد عليه السلام. يقدم الكتاب تحليلاً دقيقًا لبنية الجمل وإعراب الكلمات في هذه الأدعية، مما يسهل فهم مضمونها والتأمل في معانيها العميقة. يُعتبر هذا الكتاب مرجعًا هامًا للدارسين والمهتمين بالأدب والفكر الشيعي، حيث يساهم في توسيع المعرفة وفهم النصوص الدينية بعمق وتفصيل.",
		pagesCount: 729,
		chaptersCount: 3,
		issueDate: "١٤٣٦ هجري",
		publisher: "الأمانة العامة للعتبة الحسينية المقدسة/قسم العلاقات العامة",
		printHouse: "الأمانة العامة للعتبة الحسينية المقدسة",
		fileLocation:
			"/books/معجم اعراب الفاظ الصحيفة السجادية محمد جليل عباس ج1.pdf",
		availableLanguages: ["العربية"],
	},
	{
		id: 1,
		isbn: "",
		categoryId: categories.indexOf(CategoryTypes.Book),
		coverImageUrl:
			"/books/covers/معجم اعراب الفاظ الصحيفة السجادية محمد جليل عباس - الجزء الثاني.jpg",
		title: "مُعْجَمُ إعرابَ ألفاظِ الصَّحيفةِ السَّجاديَّةِ - الجزء الثاني",
		author: "محمد جليل عباس",
		slug: "mujam-irab-alfaz-alsahifa-alsajjadya-part-2",
		editors: [
			"سلمان محمد عبد السيد - إشراف",
			"د. علي حسن الدلفي - إشراف",
			"حسن سويدان - إخراج فني",
		],
		description:
			"هذا الكتاب يعتبر معجمًا شاملاً لإعراب الكلمات في الصحيفة السجادية، وهي مجموعة من الأدعية والأقوال التي يُنسبها الشيعة إلى الإمام علي بن الحسين، المعروف أيضًا باسم الإمام السجاد عليه السلام. يقدم الكتاب تحليلاً دقيقًا لبنية الجمل وإعراب الكلمات في هذه الأدعية، مما يسهل فهم مضمونها والتأمل في معانيها العميقة. يُعتبر هذا الكتاب مرجعًا هامًا للدارسين والمهتمين بالأدب والفكر الشيعي، حيث يساهم في توسيع المعرفة وفهم النصوص الدينية بعمق وتفصيل.",
		pagesCount: 730,
		chaptersCount: 3,
		issueDate: "١٤٣٦ هجري",
		publisher: "الأمانة العامة للعتبة الحسينية المقدسة/قسم العلاقات العامة",
		printHouse: "الأمانة العامة للعتبة الحسينية المقدسة",
		fileLocation:
			"/books/معجم اعراب الفاظ الصحيفة السجادية محمد جليل عباس ج2.pdf",
		availableLanguages: ["العربية"],
	},
	{
		id: 2,
		isbn: "",
		categoryId: categories.indexOf(CategoryTypes.Book),
		coverImageUrl:
			"/books/covers/معجم اعراب الفاظ الصحيفة السجادية محمد جليل عباس - الجزء الثالث.jpg",
		title: "مُعْجَمُ إعرابَ ألفاظِ الصَّحيفةِ السَّجاديَّةِ - الجزء الثالث",
		author: "محمد جليل عباس",
		slug: "mujam-irab-alfaz-alsahifa-alsajjadya-part-3",
		editors: [
			"سلمان محمد عبد السيد - إشراف",
			"د. علي حسن الدلفي - إشراف",
			"حسن سويدان - إخراج فني",
		],
		description:
			"هذا الكتاب يعتبر معجمًا شاملاً لإعراب الكلمات في الصحيفة السجادية، وهي مجموعة من الأدعية والأقوال التي يُنسبها الشيعة إلى الإمام علي بن الحسين، المعروف أيضًا باسم الإمام السجاد عليه السلام. يقدم الكتاب تحليلاً دقيقًا لبنية الجمل وإعراب الكلمات في هذه الأدعية، مما يسهل فهم مضمونها والتأمل في معانيها العميقة. يُعتبر هذا الكتاب مرجعًا هامًا للدارسين والمهتمين بالأدب والفكر الشيعي، حيث يساهم في توسيع المعرفة وفهم النصوص الدينية بعمق وتفصيل.",
		pagesCount: 704,
		chaptersCount: 12,
		issueDate: "١٤٣٦ هجري",
		publisher: "الأمانة العامة للعتبة الحسينية المقدسة/قسم العلاقات العامة",
		printHouse: "الأمانة العامة للعتبة الحسينية المقدسة",
		fileLocation:
			"/books/معجم اعراب الفاظ الصحيفة السجادية محمد جليل عباس ج3.pdf",
		availableLanguages: ["العربية"],
	},
	{
		id: 3,
		isbn: "",
		categoryId: categories.indexOf(CategoryTypes.Book),
		coverImageUrl:
			"/books/covers/قراءة_تربوية_في_أدعية_الصحيفة_السجادية_عماد_الكاظمي صورة.jpg",
		title: "قراءة تربوية في أدعية الصحيفة السجادية ",
		slug: "an-educational-reading-on-supplications-of-alsahifa-alsajjadya",
		author: "عماد الكاظمي",
		editors: ["لا يوجد"],
		description:
			"رؤية تربوية إصلاحية في أدعية الصحيفة السجادية هو كتاب يستكشف الأدعية المأخوذة من الصحيفة السجادية من منظور تربوي إصلاحي. يقدم الكتاب تحليلًا شاملاً ومنهجيًا للأدعية الواردة في الصحيفة السجادية، مع التركيز على الجوانب التربوية والإصلاحية لهذه الأدعية. يستند الكتاب إلى الفهم العميق للمفاهيم التربوية والدينية، محاولًا فهم دور هذه الأدعية في تنمية الفرد وتطويره نفسيًا وروحيًا واجتماعيًا. يعتبر الكتاب مرجعًا هامًا للمهتمين بالتربية الإسلامية والتطوير الذاتي، حيث يقدم نظرة عميقة ومفصلة للتفاعل بين العناصر التربوية والروحية الموجودة في الأدعية الدينية",
		pagesCount: 54,
		chaptersCount: 1,
		issueDate: "١٤٣٦ هجري",
		publisher: "معالم الفكر",
		printHouse: "",
		fileLocation:
			"/books/قراءة_تربوية_في_أدعية_الصحيفة_السجادية_عماد_الكاظمي.pdf",
		availableLanguages: ["العربية"],
	},
	{
		id: 4,
		isbn: "",
		categoryId: categories.indexOf(CategoryTypes.Book),
		coverImageUrl:
			"/books/covers/صورة_موسوعة_الإمام_زين_العابدين_ع_السيد_علي_عاشور_1.jpg",
		title: "ُموسُّوعَةُ الإمامُ زَيْنُ العابِدينَ (ع) - فَضلُهُ وَسِيرَتَهٌُ الذاتِية",
		slug: "imam-zain-alabdieen-encyclopedia-part-1",
		author: "السيد علي عاشور",
		editors: ["السيد علي عاشور - جمع واعداد"],
		description:
			"موسوعة الإمام زين العابدين للسيد علي عاشور تمثل عملاً فريدًا ينقلنا في رحلة عبر تاريخ وتراث إسلامي غني بالحكم والتعاليم. يقدم الكتاب رؤية شاملة لحياة الإمام زين العابدين، مع تسليط الضوء على مسيرته الروحية والدينية التي أثرت في عالم الإسلام بعمق. تتناول الموسوعة مفاهيم الدين والأخلاق والتربية التي نشرها الإمام زين العابدين، مما يجعلها مرجعًا هامًا للدارسين والمهتمين بالتراث الإسلامي. بالإضافة إلى ذلك، يقدم الكتاب تحليلاً عميقًا للتأثيرات الفكرية والثقافية للإمام زين العابدين على المجتمعات الإسلامية والبشرية بشكل عام. من خلال تقديم نظرة شاملة وعميقة لشخصية الإمام زين العابدين وتراثه، تعتبر هذه الموسوعة إضافة قيمة للمكتبة الإسلامية ومرجعًا أساسيًا لفهم الإسلام وتاريخه وتأثيره في العالم.",
		pagesCount: 167,
		chaptersCount: 12,
		issueDate: "١٤٣٢ هجري",
		publisher: "دار نظير عبود",
		printHouse: "",
		fileLocation:
			"/books/موسوعة_الإمام_زين_العابدين_ع_السيد_علي_عاشور_1.pdf",
		availableLanguages: ["العربية"],
	},
	{
		id: 5,
		isbn: "",
		categoryId: categories.indexOf(CategoryTypes.Book),
		coverImageUrl:
			"/books/covers/صورة_موسوعة_الإمام_زين_العابدين_ع_السيد_علي_عاشور_2.jpg",
		title: "ُموسُّوعَةُ الإمامُ زَيْنُ العابِدينَ (ع) - فَضلُهُ وَسِيرَتَهٌُ الذاتِية",
		slug: "imam-zain-alabdieen-encyclopedia-part-2",
		author: "السيد علي عاشور",
		editors: ["السيد علي عاشور - جمع واعداد"],
		description:
			"موسوعة الإمام زين العابدين للسيد علي عاشور تمثل عملاً فريدًا ينقلنا في رحلة عبر تاريخ وتراث إسلامي غني بالحكم والتعاليم. يقدم الكتاب رؤية شاملة لحياة الإمام زين العابدين، مع تسليط الضوء على مسيرته الروحية والدينية التي أثرت في عالم الإسلام بعمق. تتناول الموسوعة مفاهيم الدين والأخلاق والتربية التي نشرها الإمام زين العابدين، مما يجعلها مرجعًا هامًا للدارسين والمهتمين بالتراث الإسلامي. بالإضافة إلى ذلك، يقدم الكتاب تحليلاً عميقًا للتأثيرات الفكرية والثقافية للإمام زين العابدين على المجتمعات الإسلامية والبشرية بشكل عام. من خلال تقديم نظرة شاملة وعميقة لشخصية الإمام زين العابدين وتراثه، تعتبر هذه الموسوعة إضافة قيمة للمكتبة الإسلامية ومرجعًا أساسيًا لفهم الإسلام وتاريخه وتأثيره في العالم.",
		pagesCount: 158,
		chaptersCount: 12,
		issueDate: "١٤٣٢ هجري",
		publisher: "دار نظير عبود",
		printHouse: "",
		fileLocation:
			"/books/موسوعة_الإمام_زين_العابدين_ع_السيد_علي_عاشور_2.pdf",
		availableLanguages: ["العربية"],
	},
	{
		id: 6,
		isbn: "",
		categoryId: categories.indexOf(CategoryTypes.Book),
		coverImageUrl:
			"/books/covers/صورة_موسوعة_الإمام_زين_العابدين_ع_السيد_علي_عاشور_3.jpg",
		title: "ُِموسُّوعَةُ الإمامُ زَيْنُ العابِدينَ (ع) - لِلأدابِ الإجتماعية / شَرحُ رَسالَةِ الحَقوق",
		slug: "imam-zain-alabdieen-encyclopedia-part-3",
		author: "السيد علي عاشور",
		editors: ["السيد علي عاشور - جمع واعداد"],
		description:
			"موسوعة الإمام زين العابدين للسيد علي عاشور تمثل عملاً فريدًا ينقلنا في رحلة عبر تاريخ وتراث إسلامي غني بالحكم والتعاليم. يقدم الكتاب رؤية شاملة لحياة الإمام زين العابدين، مع تسليط الضوء على مسيرته الروحية والدينية التي أثرت في عالم الإسلام بعمق. تتناول الموسوعة مفاهيم الدين والأخلاق والتربية التي نشرها الإمام زين العابدين، مما يجعلها مرجعًا هامًا للدارسين والمهتمين بالتراث الإسلامي. بالإضافة إلى ذلك، يقدم الكتاب تحليلاً عميقًا للتأثيرات الفكرية والثقافية للإمام زين العابدين على المجتمعات الإسلامية والبشرية بشكل عام. من خلال تقديم نظرة شاملة وعميقة لشخصية الإمام زين العابدين وتراثه، تعتبر هذه الموسوعة إضافة قيمة للمكتبة الإسلامية ومرجعًا أساسيًا لفهم الإسلام وتاريخه وتأثيره في العالم.",
		pagesCount: 152,
		chaptersCount: 12,
		issueDate: "١٤٣٢ هجري",
		publisher: "دار نظير عبود",
		printHouse: "",
		fileLocation:
			"/books/موسوعة_الإمام_زين_العابدين_ع_السيد_علي_عاشور_3.pdf",
		availableLanguages: ["العربية"],
	},
	{
		id: 7,
		isbn: "",
		categoryId: categories.indexOf(CategoryTypes.Book),
		coverImageUrl:
			"/books/covers/صورة_موسوعة_الإمام_زين_العابدين_ع_السيد_علي_عاشور_4.jpg",
		title: "ُموسُّوعَةُ الإمامُ زَيْنُ العابِدينَ (ع) - فَضلُهُ وَسِيرَتَهٌُ الذاتِية",
		slug: "imam-zain-alabdieen-encyclopedia-part-4",
		author: "السيد علي عاشور",
		editors: ["السيد علي عاشور - جمع واعداد"],
		description:
			"موسوعة الإمام زين العابدين للسيد علي عاشور تمثل عملاً فريدًا ينقلنا في رحلة عبر تاريخ وتراث إسلامي غني بالحكم والتعاليم. يقدم الكتاب رؤية شاملة لحياة الإمام زين العابدين، مع تسليط الضوء على مسيرته الروحية والدينية التي أثرت في عالم الإسلام بعمق. تتناول الموسوعة مفاهيم الدين والأخلاق والتربية التي نشرها الإمام زين العابدين، مما يجعلها مرجعًا هامًا للدارسين والمهتمين بالتراث الإسلامي. بالإضافة إلى ذلك، يقدم الكتاب تحليلاً عميقًا للتأثيرات الفكرية والثقافية للإمام زين العابدين على المجتمعات الإسلامية والبشرية بشكل عام. من خلال تقديم نظرة شاملة وعميقة لشخصية الإمام زين العابدين وتراثه، تعتبر هذه الموسوعة إضافة قيمة للمكتبة الإسلامية ومرجعًا أساسيًا لفهم الإسلام وتاريخه وتأثيره في العالم.",
		pagesCount: 143,
		chaptersCount: 12,
		issueDate: "١٤٣٢ هجري",
		publisher: "دار نظير عبود",
		printHouse: "",
		fileLocation:
			"/books/موسوعة_الإمام_زين_العابدين_ع_السيد_علي_عاشور_4.pdf",
		availableLanguages: ["العربية"],
	},
	{
		id: 8,
		isbn: "",
		categoryId: categories.indexOf(CategoryTypes.Book),
		coverImageUrl:
			"/books/covers/صورة_موسوعة_الإمام_زين_العابدين_ع_السيد_علي_عاشور_5.jpg",
		title: "ُموسُّوعَةُ الإمامُ زَيْنُ العابِدينَ (ع) - الصَّحِيفَةُ السجَّاديَّة",
		slug: "imam-zain-alabdieen-encyclopedia-part-5",
		author: "السيد علي عاشور",
		editors: ["السيد علي عاشور - جمع واعداد"],
		description:
			"موسوعة الإمام زين العابدين للسيد علي عاشور تمثل عملاً فريدًا ينقلنا في رحلة عبر تاريخ وتراث إسلامي غني بالحكم والتعاليم. يقدم الكتاب رؤية شاملة لحياة الإمام زين العابدين، مع تسليط الضوء على مسيرته الروحية والدينية التي أثرت في عالم الإسلام بعمق. تتناول الموسوعة مفاهيم الدين والأخلاق والتربية التي نشرها الإمام زين العابدين، مما يجعلها مرجعًا هامًا للدارسين والمهتمين بالتراث الإسلامي. بالإضافة إلى ذلك، يقدم الكتاب تحليلاً عميقًا للتأثيرات الفكرية والثقافية للإمام زين العابدين على المجتمعات الإسلامية والبشرية بشكل عام. من خلال تقديم نظرة شاملة وعميقة لشخصية الإمام زين العابدين وتراثه، تعتبر هذه الموسوعة إضافة قيمة للمكتبة الإسلامية ومرجعًا أساسيًا لفهم الإسلام وتاريخه وتأثيره في العالم.",
		pagesCount: 158,
		chaptersCount: 12,
		issueDate: "١٤٣٢ هجري",
		publisher: "دار نظير عبود",
		printHouse: "",
		fileLocation:
			"/books/موسوعة_الإمام_زين_العابدين_ع_السيد_علي_عاشور_5.pdf",
		availableLanguages: ["العربية"],
	},
	{
		id: 9,
		isbn: "",
		categoryId: categories.indexOf(CategoryTypes.Book),
		coverImageUrl:
			"/books/covers/صورة_موسوعة_الإمام_زين_العابدين_ع_السيد_علي_عاشور_6.jpg",
		title: "ُموسُّوعَةُ الإمامُ زَيْنُ العابِدينَ (ع) - الصَّحِيفَةُ السجَّاديَّة للِسَّيد نعَمة اللّه الجّزائري",
		slug: "imam-zain-alabdieen-encyclopedia-part-6",
		author: "السيد علي عاشور",
		editors: ["السيد علي عاشور - جمع واعداد"],
		description:
			"موسوعة الإمام زين العابدين للسيد علي عاشور تمثل عملاً فريدًا ينقلنا في رحلة عبر تاريخ وتراث إسلامي غني بالحكم والتعاليم. يقدم الكتاب رؤية شاملة لحياة الإمام زين العابدين، مع تسليط الضوء على مسيرته الروحية والدينية التي أثرت في عالم الإسلام بعمق. تتناول الموسوعة مفاهيم الدين والأخلاق والتربية التي نشرها الإمام زين العابدين، مما يجعلها مرجعًا هامًا للدارسين والمهتمين بالتراث الإسلامي. بالإضافة إلى ذلك، يقدم الكتاب تحليلاً عميقًا للتأثيرات الفكرية والثقافية للإمام زين العابدين على المجتمعات الإسلامية والبشرية بشكل عام. من خلال تقديم نظرة شاملة وعميقة لشخصية الإمام زين العابدين وتراثه، تعتبر هذه الموسوعة إضافة قيمة للمكتبة الإسلامية ومرجعًا أساسيًا لفهم الإسلام وتاريخه وتأثيره في العالم.",
		pagesCount: 144,
		chaptersCount: 12,
		issueDate: "١٤٣٢ هجري",
		publisher: "دار نظير عبود",
		printHouse: "",
		fileLocation:
			"/books/موسوعة_الإمام_زين_العابدين_ع_السيد_علي_عاشور_6.pdf",
		availableLanguages: ["العربية"],
	},
	{
		id: 10,
		isbn: "",
		categoryId: categories.indexOf(CategoryTypes.Book),
		coverImageUrl:
			"/books/covers/صورة_موسوعة_الإمام_زين_العابدين_ع_السيد_علي_عاشور_7.jpg",
		title: "ُموسُّوعَةُ الإمامُ زَيْنُ العابِدينَ (ع) - الصَّحِيفَةُ السجَّاديَّة للِسَّيد نعَمة اللّه الجّزائري",
		slug: "imam-zain-alabdieen-encyclopedia-part-7",
		author: "السيد علي عاشور",
		editors: ["السيد علي عاشور - جمع واعداد"],
		description:
			"موسوعة الإمام زين العابدين للسيد علي عاشور تمثل عملاً فريدًا ينقلنا في رحلة عبر تاريخ وتراث إسلامي غني بالحكم والتعاليم. يقدم الكتاب رؤية شاملة لحياة الإمام زين العابدين، مع تسليط الضوء على مسيرته الروحية والدينية التي أثرت في عالم الإسلام بعمق. تتناول الموسوعة مفاهيم الدين والأخلاق والتربية التي نشرها الإمام زين العابدين، مما يجعلها مرجعًا هامًا للدارسين والمهتمين بالتراث الإسلامي. بالإضافة إلى ذلك، يقدم الكتاب تحليلاً عميقًا للتأثيرات الفكرية والثقافية للإمام زين العابدين على المجتمعات الإسلامية والبشرية بشكل عام. من خلال تقديم نظرة شاملة وعميقة لشخصية الإمام زين العابدين وتراثه، تعتبر هذه الموسوعة إضافة قيمة للمكتبة الإسلامية ومرجعًا أساسيًا لفهم الإسلام وتاريخه وتأثيره في العالم.",
		pagesCount: 144,
		chaptersCount: 12,
		issueDate: "١٤٣٢ هجري",
		publisher: "دار نظير عبود",
		printHouse: "",
		fileLocation:
			"/books/موسوعة_الإمام_زين_العابدين_ع_السيد_علي_عاشور_7.pdf",
		availableLanguages: ["العربية"],
	},
	{
		id: 11,
		isbn: "",
		categoryId: categories.indexOf(CategoryTypes.Book),
		coverImageUrl:
			"/books/covers/صورة_موسوعة_الإمام_زين_العابدين_ع_السيد_علي_عاشور_8.jpg",
		title: "ُموسُّوعَةُ الإمامُ زَيْنُ العابِدينَ (ع) - الصَّحِيفَةُ السجَّاديَّة للِسَّيد نعَمة اللّه الجّزائري",
		slug: "imam-zain-alabdieen-encyclopedia-part-8",
		author: "السيد علي عاشور",
		editors: ["السيد علي عاشور - جمع واعداد"],
		description:
			"موسوعة الإمام زين العابدين للسيد علي عاشور تمثل عملاً فريدًا ينقلنا في رحلة عبر تاريخ وتراث إسلامي غني بالحكم والتعاليم. يقدم الكتاب رؤية شاملة لحياة الإمام زين العابدين، مع تسليط الضوء على مسيرته الروحية والدينية التي أثرت في عالم الإسلام بعمق. تتناول الموسوعة مفاهيم الدين والأخلاق والتربية التي نشرها الإمام زين العابدين، مما يجعلها مرجعًا هامًا للدارسين والمهتمين بالتراث الإسلامي. بالإضافة إلى ذلك، يقدم الكتاب تحليلاً عميقًا للتأثيرات الفكرية والثقافية للإمام زين العابدين على المجتمعات الإسلامية والبشرية بشكل عام. من خلال تقديم نظرة شاملة وعميقة لشخصية الإمام زين العابدين وتراثه، تعتبر هذه الموسوعة إضافة قيمة للمكتبة الإسلامية ومرجعًا أساسيًا لفهم الإسلام وتاريخه وتأثيره في العالم.",
		pagesCount: 161,
		chaptersCount: 12,
		issueDate: "١٤٣٢ هجري",
		publisher: "دار نظير عبود",
		printHouse: "",
		fileLocation:
			"/books/موسوعة_الإمام_زين_العابدين_ع_السيد_علي_عاشور_8.pdf",
		availableLanguages: ["العربية"],
	},
	{
		id: 12,
		isbn: "",
		categoryId: categories.indexOf(CategoryTypes.Book),
		coverImageUrl:
			"/books/covers/صورة_موسوعة_الإمام_زين_العابدين_ع_السيد_علي_عاشور_9.jpg",
		title: "ُموسُّوعَةُ الإمامُ زَيْنُ العابِدينَ (ع) - مَا أّسنَدَهٌ الإمَام عَلَيهِ السّلاَم",
		slug: "imam-zain-alabdieen-encyclopedia-part-9",
		author: "السيد علي عاشور",
		editors: ["السيد علي عاشور - جمع واعداد"],
		description:
			"موسوعة الإمام زين العابدين للسيد علي عاشور تمثل عملاً فريدًا ينقلنا في رحلة عبر تاريخ وتراث إسلامي غني بالحكم والتعاليم. يقدم الكتاب رؤية شاملة لحياة الإمام زين العابدين، مع تسليط الضوء على مسيرته الروحية والدينية التي أثرت في عالم الإسلام بعمق. تتناول الموسوعة مفاهيم الدين والأخلاق والتربية التي نشرها الإمام زين العابدين، مما يجعلها مرجعًا هامًا للدارسين والمهتمين بالتراث الإسلامي. بالإضافة إلى ذلك، يقدم الكتاب تحليلاً عميقًا للتأثيرات الفكرية والثقافية للإمام زين العابدين على المجتمعات الإسلامية والبشرية بشكل عام. من خلال تقديم نظرة شاملة وعميقة لشخصية الإمام زين العابدين وتراثه، تعتبر هذه الموسوعة إضافة قيمة للمكتبة الإسلامية ومرجعًا أساسيًا لفهم الإسلام وتاريخه وتأثيره في العالم.",
		pagesCount: 161,
		chaptersCount: 12,
		issueDate: "١٤٣٢ هجري",
		publisher: "دار نظير عبود",
		printHouse: "",
		fileLocation:
			"/books/موسوعة_الإمام_زين_العابدين_ع_السيد_علي_عاشور_9.pdf",
		availableLanguages: ["العربية"],
	},
	{
		id: 13,
		isbn: "",
		categoryId: categories.indexOf(CategoryTypes.Book),
		coverImageUrl:
			"/books/covers/صورة_موسوعة_الإمام_زين_العابدين_ع_السيد_علي_عاشور_10.jpg",
		title: "ُموسُّوعَةُ الإمامُ زَيْنُ العابِدينَ (ع) - مَا رَوَاهُ (ع) في منَاقِبِ أَهْلِ البَيْت (ع)",
		slug: "imam-zain-alabdieen-encyclopedia-part-10",
		author: "السيد علي عاشور",
		editors: ["السيد علي عاشور - جمع واعداد"],
		description:
			"موسوعة الإمام زين العابدين للسيد علي عاشور تمثل عملاً فريدًا ينقلنا في رحلة عبر تاريخ وتراث إسلامي غني بالحكم والتعاليم. يقدم الكتاب رؤية شاملة لحياة الإمام زين العابدين، مع تسليط الضوء على مسيرته الروحية والدينية التي أثرت في عالم الإسلام بعمق. تتناول الموسوعة مفاهيم الدين والأخلاق والتربية التي نشرها الإمام زين العابدين، مما يجعلها مرجعًا هامًا للدارسين والمهتمين بالتراث الإسلامي. بالإضافة إلى ذلك، يقدم الكتاب تحليلاً عميقًا للتأثيرات الفكرية والثقافية للإمام زين العابدين على المجتمعات الإسلامية والبشرية بشكل عام. من خلال تقديم نظرة شاملة وعميقة لشخصية الإمام زين العابدين وتراثه، تعتبر هذه الموسوعة إضافة قيمة للمكتبة الإسلامية ومرجعًا أساسيًا لفهم الإسلام وتاريخه وتأثيره في العالم.",
		pagesCount: 165,
		chaptersCount: 12,
		issueDate: "١٤٣٢ هجري",
		publisher: "دار نظير عبود",
		printHouse: "",
		fileLocation:
			"/books/موسوعة_الإمام_زين_العابدين_ع_السيد_علي_عاشور_10.pdf",
		availableLanguages: ["العربية"],
	},
	{
		id: 14,
		isbn: "",
		categoryId: categories.indexOf(CategoryTypes.Book),
		coverImageUrl:
			"/books/covers/صورة_موسوعة_الإمام_زين_العابدين_ع_السيد_علي_عاشور_11.jpg",
		title: "ُموسُّوعَةُ الإمامُ زَيْنُ العابِدينَ (ع) - مَا رَوَاهُ (ع) في منَاقِبِ أَهْلِ البَيْت (ع)",
		slug: "imam-zain-alabdieen-encyclopedia-part-11",
		author: "السيد علي عاشور",
		editors: ["السيد علي عاشور - جمع واعداد"],
		description:
			"موسوعة الإمام زين العابدين للسيد علي عاشور تمثل عملاً فريدًا ينقلنا في رحلة عبر تاريخ وتراث إسلامي غني بالحكم والتعاليم. يقدم الكتاب رؤية شاملة لحياة الإمام زين العابدين، مع تسليط الضوء على مسيرته الروحية والدينية التي أثرت في عالم الإسلام بعمق. تتناول الموسوعة مفاهيم الدين والأخلاق والتربية التي نشرها الإمام زين العابدين، مما يجعلها مرجعًا هامًا للدارسين والمهتمين بالتراث الإسلامي. بالإضافة إلى ذلك، يقدم الكتاب تحليلاً عميقًا للتأثيرات الفكرية والثقافية للإمام زين العابدين على المجتمعات الإسلامية والبشرية بشكل عام. من خلال تقديم نظرة شاملة وعميقة لشخصية الإمام زين العابدين وتراثه، تعتبر هذه الموسوعة إضافة قيمة للمكتبة الإسلامية ومرجعًا أساسيًا لفهم الإسلام وتاريخه وتأثيره في العالم.",
		pagesCount: 184,
		chaptersCount: 12,
		issueDate: "١٤٣٢ هجري",
		publisher: "دار نظير عبود",
		printHouse: "",
		fileLocation:
			"/books/موسوعة_الإمام_زين_العابدين_ع_السيد_علي_عاشور_11.pdf",
		availableLanguages: ["العربية"],
	},
	{
		id: 15,
		isbn: "",
		categoryId: categories.indexOf(CategoryTypes.Book),
		coverImageUrl:
			"/books/covers/صورة_موسوعة_الإمام_زين_العابدين_ع_السيد_علي_عاشور_12.jpg",
		title: "ُموسُّوعَةُ الإمامُ زَيْنُ العابِدينَ (ع) - مَا رَوَاهُ (ع) في فَضلِ أمِيرِ المُؤمِنين (ع)",
		slug: "imam-zain-alabdieen-encyclopedia-part-12",
		author: "السيد علي عاشور",
		editors: ["السيد علي عاشور - جمع واعداد"],
		description:
			"موسوعة الإمام زين العابدين للسيد علي عاشور تمثل عملاً فريدًا ينقلنا في رحلة عبر تاريخ وتراث إسلامي غني بالحكم والتعاليم. يقدم الكتاب رؤية شاملة لحياة الإمام زين العابدين، مع تسليط الضوء على مسيرته الروحية والدينية التي أثرت في عالم الإسلام بعمق. تتناول الموسوعة مفاهيم الدين والأخلاق والتربية التي نشرها الإمام زين العابدين، مما يجعلها مرجعًا هامًا للدارسين والمهتمين بالتراث الإسلامي. بالإضافة إلى ذلك، يقدم الكتاب تحليلاً عميقًا للتأثيرات الفكرية والثقافية للإمام زين العابدين على المجتمعات الإسلامية والبشرية بشكل عام. من خلال تقديم نظرة شاملة وعميقة لشخصية الإمام زين العابدين وتراثه، تعتبر هذه الموسوعة إضافة قيمة للمكتبة الإسلامية ومرجعًا أساسيًا لفهم الإسلام وتاريخه وتأثيره في العالم.",
		pagesCount: 177,
		chaptersCount: 12,
		issueDate: "١٤٣٢ هجري",
		publisher: "دار نظير عبود",
		printHouse: "",
		fileLocation:
			"/books/موسوعة_الإمام_زين_العابدين_ع_السيد_علي_عاشور_12.pdf",
		availableLanguages: ["العربية"],
	},
]

export const activities = [{}]
