import Activities from "@/components/activities"
import Publications from "@/components/publications"
import Link from "next/link"
import Image from "next/image"
import { ArrowLeftIcon } from "@radix-ui/react-icons"
import { CircleArrowLeft } from "@/components/icons"

const sections = [
	{
		imageUrl: "bg-[url(/images/sections/1.png)]",
		gradientColor: "to-yellow-800",
		title: "المكتبة التخصصية",
		subtitle:
			"مكتبة مليئة بالكتب والمخطوطات الحاوية لتعليمات الامام السجاد (ع)",
		icon: (
			<svg
				className="h-12 group-hover:h-16 p-2 w-auto transition-all duration-500 mx-3 text-gray-200"
				width={24}
				height={24}
				viewBox="0 0 512 512"
				fill="currentColor"
				strokeWidth={1}
				color="currentColor"
			>
				<path d="M493.028,288.695v-34.227c10.971-3.36,18.972-13.582,18.972-25.638c0-14.782-12.027-26.809-26.809-26.809H412.17 c11.308-12.071,17.91-29.469,17.91-46.209c0-31.56-22.502-55.359-52.342-55.359c-2.063,0-4.113,0.135-6.151,0.362V69.878 c0-4.329-3.508-7.837-7.837-7.837s-7.837,3.508-7.837,7.837v6.781c-0.698-1.107-1.46-2.182-2.304-3.213 c-13.984-17.098-42.762-15.692-43.973-15.626c-4.142,0.232-7.385,3.65-7.4,7.798c-0.075,21.733,5.538,36.825,16.657,44.916 c-13.179,9.852-21.471,26.131-21.471,45.279c0,16.739,6.602,34.138,17.909,46.208h-48.452c-5.453,0-10.89,0.637-16.158,1.895 c-4.21,1.005-6.807,5.233-5.802,9.443s5.233,6.805,9.443,5.802c4.077-0.974,8.29-1.467,12.518-1.467h218.313 c6.14,0,11.135,4.996,11.135,11.135c0,6.14-4.996,11.135-11.135,11.135H266.878c-17.433,0-31.615,14.182-31.615,31.617 c0,17.433,14.182,31.615,31.615,31.615h218.313c6.14,0,11.135,4.996,11.135,11.135s-4.996,11.135-11.135,11.135h-33.139H266.878 c-29.714,0-53.887-24.174-53.887-53.886c0-14.367,5.613-27.891,15.804-38.084c3.06-3.06,3.06-8.023,0-11.082 c-3.061-3.059-8.023-3.06-11.082,0.001c-13.152,13.152-20.395,30.613-20.395,49.167c0,22.123,10.394,41.851,26.54,54.601 c-17.671,2.526-33.219,11.708-44.013,24.928v-84.325c0-4.329-3.509-7.837-7.837-7.837c-4.328,0-7.837,3.508-7.837,7.837V433.94 c0,8.26-6.72,14.98-14.98,14.98h-36.448c-8.26,0-14.98-6.72-14.98-14.98V194.026h66.408v39.641c0,4.329,3.509,7.837,7.837,7.837 c4.328,0,7.837-3.508,7.837-7.837V78.062c0-16.902-13.751-30.653-30.653-30.653h-36.448c-9.056,0-17.204,3.951-22.821,10.215 c-5.616-6.264-13.764-10.215-22.821-10.215h-36.45C13.751,47.409,0,61.16,0,78.062v287.075c0,4.329,3.509,7.837,7.837,7.837 c4.328,0,7.837-3.508,7.837-7.837V194.026h66.409v239.912c0,8.26-6.72,14.98-14.98,14.98H30.653c-8.26,0-14.98-6.72-14.98-14.98 v-35.181c0-4.329-3.509-7.837-7.837-7.837c-4.328,0-7.837,3.508-7.837,7.837v35.181c0,16.902,13.751,30.653,30.653,30.653h36.448 c9.056,0,17.204-3.951,22.821-10.215c5.616,6.264,13.764,10.215,22.821,10.215h36.448c15.347,0,28.095-11.338,30.31-26.079 c12.759,15.883,32.326,26.078,54.238,26.078h218.313c14.782,0,26.809-12.027,26.809-26.809c0-12.057-8.002-22.277-18.972-25.638 v-34.227c10.971-3.36,18.972-13.582,18.972-25.638c0-3.972-0.875-7.742-2.431-11.135h8.761c14.782,0,26.809-12.027,26.809-26.809 C512,302.275,503.998,292.055,493.028,288.695z M318.213,73.756c7.242,0.698,17.77,2.894,23.264,9.612 c3.431,4.196,4.525,9.838,3.31,17.167c-4.149,0.819-10.918,1.306-16.313-2.391C322.714,94.198,319.219,85.839,318.213,73.756z M377.739,202.021c-3.981,0-7.911-0.588-11.683-1.749c-1.494-0.461-3.116-0.461-4.61,0c-3.771,1.16-7.702,1.749-11.683,1.749 c-21.609,0-36.668-24.352-36.668-46.208c0-22.624,15.763-39.685,36.668-39.685c3.967,0,7.886,0.586,11.651,1.741 c0.342,0.107,0.696,0.182,1.056,0.241c1.207,0.202,2.449,0.123,3.622-0.242c3.765-1.154,7.683-1.74,11.647-1.74 c20.904,0,36.669,17.061,36.669,39.685C414.408,177.668,399.349,202.021,377.739,202.021z M477.354,263.492h-53.844 c-4.329,0-7.837,3.508-7.837,7.837c0,4.329,3.508,7.837,7.837,7.837h53.844v8.358H266.878c-8.791,0-15.942-7.151-15.942-15.942 c0-8.791,7.151-15.943,15.942-15.943h210.476V263.492z M15.673,78.062c0-8.26,6.72-14.98,14.98-14.98h36.448 c8.26,0,14.98,6.72,14.98,14.98v66.747H15.673V78.062z M82.082,178.353H15.673v-17.871h66.409V178.353z M97.763,78.062 c0-8.26,6.72-14.98,14.98-14.98h36.448c8.26,0,14.98,6.72,14.98,14.98v66.747H97.763V78.062z M97.763,160.482h66.409v17.871 H97.763V160.482z M452.052,363.413h-51.498c-4.329,0-7.837,3.508-7.837,7.837c0,4.329,3.508,7.837,7.837,7.837h43.661v31.885 H233.739c-5.941,0-11.125-3.273-13.867-8.105h180.683c4.329,0,7.837-3.508,7.837-7.837c0-4.329-3.508-7.837-7.837-7.837H219.873 c2.742-4.833,7.926-8.106,13.867-8.106h131.219c4.329,0,7.837-3.508,7.837-7.837c0-4.329-3.508-7.837-7.837-7.837H233.739 c-17.433,0-31.615,14.182-31.615,31.617c0,17.433,14.182,31.615,31.615,31.615h218.313c6.14,0,11.135,4.996,11.135,11.135 s-4.996,11.135-11.135,11.135H233.739c-29.714,0-53.888-24.174-53.888-53.886c0-29.715,24.174-53.887,53.888-53.887h33.139 h185.174c6.14-0.001,11.135,4.996,11.135,11.135S458.192,363.413,452.052,363.413z" />
				<path d="M45.061,239.965c-4.328,0-7.837,3.508-7.837,7.837v133.52c0,4.329,3.509,7.837,7.837,7.837 c4.328,0,7.837-3.508,7.837-7.836V247.802C52.898,243.473,49.389,239.965,45.061,239.965z" />
				<path d="M123.232,239.965c-4.328,0-7.837,3.509-7.837,7.837v133.52c0,4.329,3.509,7.837,7.837,7.837 c4.328,0,7.837-3.508,7.837-7.837v-133.52C131.069,243.473,127.56,239.965,123.232,239.965z" />
			</svg>
		),
	},
	{
		imageUrl: "bg-[url(/images/sections/2.png)]",
		gradientColor: "to-slate-700",
		title: "المشاريع",
		subtitle: "تعزيز ونشر الوعي حول تراث الامام زين العابدين (ع)",
		icon: (
			<svg
				className="h-12 group-hover:h-16 p-2 w-auto transition-all duration-500 mx-3 text-gray-200"
				width={24}
				height={24}
				viewBox="0 0 512 512"
				fill="currentColor"
				strokeWidth={1}
				color="currentColor"
			>
				<rect
					height="10.001"
					transform="matrix(0.7197 0.6943 -0.6943 0.7197 311.851 -7.1505)"
					width="13.07"
					x="158.247"
					y="377.667"
				/>
				<path d="M44.485,241.19c-0.778,3.29-0.323,6.854,1.28,10.036s4.197,5.668,7.305,7c1.609,0.689,3.296,1.033,4.956,1.033 c1.805,0,3.579-0.406,5.188-1.217l2.56-1.289l4.693,9.479l-2.936,1.479c-6.161,3.105-8.36,11.217-4.901,18.08 c1.604,3.182,4.197,5.668,7.305,7c1.609,0.689,3.296,1.033,4.956,1.033c1.805,0,3.579-0.406,5.188-1.217l2.759-1.391l4.742,9.578 l-2.939,1.48c-6.162,3.105-8.361,11.215-4.902,18.08c1.604,3.182,4.197,5.666,7.305,6.998c1.609,0.691,3.296,1.035,4.956,1.035 c1.805,0,3.579-0.406,5.188-1.217l2.764-1.393l27.982,56.518l0.385,0.779l3.08,2.967l-1.849,1.896 c-4.816,4.939-4.26,13.324,1.243,18.691c2.9,2.828,6.604,4.262,10.165,4.262c3.194,0,6.273-1.154,8.552-3.49l1.963-2.014 l10.22,9.848l-2.06,2.109c-4.821,4.938-4.27,13.322,1.229,18.691c2.549,2.49,5.81,4,9.181,4.252 c0.326,0.023,0.65,0.035,0.974,0.035c3.283,0,6.362-1.248,8.562-3.502l2.189-2.24l0.416,0.4c3.782,3.645,8.18,6.441,12.945,8.309 l0.016,5.285c0.003,0.846,0.102,1.674,0.283,2.473H94.94v10h114.131c0.016,0,0.031,0,0.047,0h117.936v-10H222.734 c0.191-0.836,0.289-1.691,0.286-2.555l-0.007-2.5h26.169c6.384,0,11.577-5.193,11.577-11.576v-7.033 c0-20.842-13.067-36.367-31.64-38.438l-7.687-46.484h10.562v-10h-9.462l1.384-11.334h11.078v-10h-9.858l1.384-11.332h10.141v-10 h-8.92l1.383-11.334h10.204v-10h-8.983l3.319-27.2c0.388-3.171-0.007-6.333-1.079-9.243L403.857,92.585l-6.313-7.755 l-89.949,73.229l-47.583-59.863l70.334-61.552l-6.586-7.525L180.009,154.921l-0.241-0.313c-2.642-3.425-7.367-4.512-11.237-2.582 L65.823,203.233c-10.906,4.748-16.302,17.354-12.327,28.489l-2.827,1.425C47.581,234.703,45.327,237.635,44.485,241.19z M58.714,249.113c-0.609,0.308-1.33,0.083-1.703-0.078c-0.934-0.4-1.777-1.242-2.315-2.309c-0.537-1.067-0.712-2.246-0.479-3.234 c0.094-0.397,0.343-1.108,0.952-1.416l2.672-1.346l3.495,7.061L58.714,249.113z M75.578,283.676 c-0.61,0.307-1.328,0.084-1.703-0.076c-0.934-0.4-1.777-1.242-2.315-2.309c-1.015-2.014-0.587-4.115,0.473-4.65l2.872-1.445 l3.495,7.059L75.578,283.676z M92.686,318.24c-0.609,0.309-1.33,0.084-1.703-0.076c-0.934-0.4-1.777-1.242-2.315-2.309 c-1.015-2.014-0.587-4.115,0.473-4.65l2.876-1.449l3.496,7.061L92.686,318.24z M97.267,297.822l0.639-4.096 c4.762-30.496,1.134-61.558-10.442-90.108l24.006-11.968c1.095,20.161,5.526,39.84,13.234,58.628l2.124,5.175 c16.214,39.519,20.324,82.179,12.017,123.878l-2.336-2.252L97.267,297.822z M142.348,400.42c-0.831,0.85-2.963,0.623-4.575-0.949 c-1.614-1.574-1.894-3.701-1.064-4.551l1.89-1.938l5.672,5.467L142.348,400.42z M172.422,429.836 c-0.476,0.488-1.231,0.51-1.636,0.48c-1.013-0.076-2.084-0.598-2.939-1.434c-1.613-1.574-1.891-3.701-1.062-4.551l2.106-2.156 l5.674,5.467L172.422,429.836z M213.021,448.523c0.002,0.682-0.52,1.225-0.831,1.488c-0.775,0.656-1.905,1.033-3.101,1.037 c-0.006,0-0.012,0-0.018,0c-2.245,0-3.925-1.318-3.929-2.502l-0.008-2.799c1.435,0.156,2.882,0.246,4.344,0.246h3.535 L213.021,448.523z M183.586,176.162c2.209-1.324,3.754-3.528,4.244-6.059c0.493-2.547-0.129-5.185-1.706-7.244l45.385-39.719 l46.617,58.911l-51.28,41.747c-4.866-4.147-11.436-5.699-17.65-4.142l-6.271,1.571c-11.942,2.991-24.388-3.372-28.957-14.8 C168.674,193.185,171.729,183.566,183.586,176.162z M299.841,164.373l-13.959,11.364l-46.838-59.19l13.435-11.757L299.841,164.373 z M172.312,161.316l5.258,6.822c-15.207,9.863-19.785,24.746-12.887,42.001c6.418,16.053,23.901,24.989,40.673,20.789l6.271-1.571 c3.176-0.796,6.411-0.01,8.869,2.16c2.458,2.17,3.64,5.281,3.243,8.535l-3.468,28.412h-15.942v10h14.722l-1.383,11.334h-13.339v10 h12.118l-1.383,11.332h-10.735v10h9.515l-1.383,11.334h-8.132v10h6.971l9.3,56.248h4.241c11.22,0,20.14,6.732,23.936,17.064 h-33.444c-5.226,0-10.314-1.822-14.351-5.137l-20.121-19.41l-6.943,7.197l20.258,19.541l0.27,0.242 c5.852,4.879,13.27,7.566,20.888,7.566h35.393c0.023,0.531,0.036,1.068,0.036,1.609v7.033c0,0.869-0.707,1.576-1.577,1.576 h-39.704c-7.632,0-14.862-2.918-20.357-8.213l-41.804-40.283c10.401-45.598,6.534-92.523-11.238-135.84l-2.124-5.175 c-7.833-19.092-12.087-39.159-12.684-59.719L172.312,161.316z M69.895,212.368l0.136-0.058l8.461-4.218 c9.361,23.41,13.048,48.59,10.805,73.635l-26.283-53.086C60.581,222.309,63.64,215.039,69.895,212.368z" />
				<polygon points="185.216,340.055 195.886,377.145 205.495,374.379 195.165,338.469 191.688,241.701 181.693,242.06 185.193,339.441 " />
				<path d="M305.289,251.904c-42.081,28.252-53.332,85.475-25.079,127.557c17.72,26.393,46.827,40.658,76.456,40.654 c17.611,0,35.412-5.043,51.101-15.576c42.081-28.254,53.332-85.475,25.079-127.557 C404.594,234.902,347.371,223.651,305.289,251.904z M424.543,282.557c2.695,4.016,4.963,8.191,6.861,12.467l-16.453-6.027 l0.651-17.531C418.845,274.844,421.845,278.539,424.543,282.557z M405.915,262.863l-0.998,26.848l-28.498,19.133l-26.674-9.773 l-22.735-25.152l9.189-25.057c6.657-1.698,13.445-2.537,20.205-2.537C374.086,246.324,391.558,252.034,405.915,262.863z M351.434,310.338l20.527,7.521l-0.81,21.848l-21.122-7.123L351.434,310.338z M310.863,260.207 c4.231-2.842,8.638-5.228,13.157-7.184l-6.19,16.879l-18.126-0.67C303.104,265.961,306.813,262.926,310.863,260.207z M291.119,278.922l27.865,1.029l22.758,25.178l-1.778,28.191L303.2,358.002l-26.046-9.541 C271.056,324.449,276.214,298.736,291.119,278.922z M288.513,373.887c-2.861-4.262-5.244-8.703-7.207-13.256l17.435,6.389 l-0.689,18.582C294.56,382.027,291.357,378.123,288.513,373.887z M340.724,408.605c-12.136-2.387-23.334-7.365-32.981-14.523 l1.032-27.777l36.763-24.682l26.767,9.025l14.688,30.596l-9.616,26.23C365.547,410.596,353.076,411.033,340.724,408.605z M402.192,396.236c-4.027,2.705-8.243,5.002-12.588,6.93l6.25-17.049l17.944,0.66C410.28,390.217,406.421,393.398,402.192,396.236 z M422.271,377.082l-26.657-0.98l-14.673-30.568l1.052-28.387l28.498-19.133l25.211,9.234 C442.049,331.291,437.073,357.127,422.271,377.082z" />
				<rect height="10" width="78.667" x="389.219" y="451.049" />
				<rect height="10" width="22.354" x="346.864" y="451.049" />
				<rect height="10" width="26.144" x="49.116" y="451.049" />
				<rect height="10" width="48.516" x="67.675" y="472.881" />
				<rect height="10" width="26.229" x="138.553" y="472.881" />
				<rect height="10" width="185.041" x="215.66" y="472.881" />
				<rect height="10" width="25.043" x="424.843" y="472.881" />
			</svg>
		),
	},
	{
		imageUrl: "bg-[url(/images/sections/3.png)]",
		gradientColor: "to-slate-900",
		title: "النشاطات",
		subtitle: "في محاولة ذكرى الامام وتمديد التأثير الذي تركه عليه السلام",
		icon: (
			<svg
				className="h-12 group-hover:h-16 p-2 w-auto transition-all duration-500 mx-3 text-gray-200"
				width={24}
				height={24}
				viewBox="0 0 24 24"
				fill="currentColor"
				strokeWidth={1}
				color="currentColor"
			>
				<path d="M8 6H5c-.553 0-1-.448-1-1s.447-1 1-1h3c.553 0 1 .448 1 1s-.447 1-1 1zM13 10H5c-.553 0-1-.448-1-1s.447-1 1-1h8c.553 0 1 .448 1 1s-.447 1-1 1zM13 14H5c-.553 0-1-.448-1-1s.447-1 1-1h8c.553 0 1 .448 1 1s-.447 1-1 1z" />
				<path d="M18 2v8c0 .55-.45 1-1 1s-1-.45-1-1V2.5c0-.28-.22-.5-.5-.5h-13c-.28 0-.5.22-.5.5v19c0 .28.22.5.5.5h13c.28 0 .5-.22.5-.5V21c0-.55.45-1 1-1s1 .45 1 1v1c0 1.1-.9 2-2 2H2c-1.1 0-2-.9-2-2V2C0 .9.9 0 2 0h14c1.1 0 2 .9 2 2z" />
				<path d="M23.87 11.882c.31.54.045 1.273-.595 1.643l-9.65 5.57c-.084.05-.176.086-.265.11l-2.656.66c-.37.092-.72-.035-.88-.314-.162-.278-.09-.65.17-.913l1.907-1.958c.063-.072.137-.123.214-.167.004-.01.012-.015.012-.015l9.65-5.57c.64-.37 1.408-.234 1.72.305l.374.65z" />
			</svg>
		),
	},
	,
	{
		imageUrl: "bg-[url(/images/sections/4.png)]",
		gradientColor: "to-yellow-900",
		title: "الكتب والاصدارات",
		subtitle: "مجموعة غنية من الكتب التي تسلط الضوء على حياته الكريمة (ع)",
		icon: (
			<svg
				className="h-12 group-hover:h-16 p-2 w-auto transition-all duration-500 mx-3 text-gray-200"
				width={24}
				height={24}
				viewBox="0 0 512 512"
				fill="currentColor"
				strokeWidth={1}
				color="currentColor"
			>
				<path d="M430.135,14.339h0.017c0-0.008,0-0.008,0-0.008L430.135,14.339z" />
				<path d="M508.672,96.445c-2.126-2.118-5.059-3.327-8.06-3.327c-17.409,0-34.202,2.092-50.238,4.983 c0.034-23.387,0.085-68.453,0.085-70.589c0-2.015-0.411-4.254-1.406-6.269c-0.721-1.509-1.715-2.881-2.83-3.979 c-1.698-1.638-3.585-2.649-5.3-3.259c-1.767-0.592-3.396-0.832-4.992-0.832c-1.852,0.018-3.67,0.274-5.78,1.166 c-19.45,8.302-39.312,20.205-58.436,34.407c-28.678,21.303-55.64,47.785-76.258,75.451c-10.308,13.841-19.038,28.001-25.539,42.074 c-4.854,10.54-8.49,21.046-10.497,31.405h-6.895c-2.916-14.982-9.125-30.256-17.649-45.496 c-15.831-28.146-39.638-56.223-66.635-80.554c-27.049-24.304-57.236-44.818-86.394-57.296c-2.092-0.884-3.91-1.14-5.762-1.158 c-1.424,0-2.865,0.18-4.408,0.643c-1.149,0.352-2.35,0.858-3.55,1.612c-1.784,1.115-3.585,2.856-4.802,5.078 c-1.236,2.195-1.784,4.742-1.767,7.006c0,2.136,0.051,47.202,0.085,70.589c-16.054-2.89-32.846-4.983-50.254-4.983 c-2.985,0-5.935,1.209-8.044,3.327C1.218,98.572,0,101.496,0,104.489V384.63c0,5.669,4.168,10.472,9.794,11.269 c14.836,2.11,32.314,6.046,50.718,11.638c27.632,8.371,57.356,20.454,83.752,35.333c13.19,7.427,25.54,15.556,36.379,24.21 c10.858,8.654,20.171,17.838,27.375,27.272c2.144,2.813,5.523,4.476,9.056,4.476h77.87c3.533,0,6.912-1.663,9.056-4.476 c9.588-12.59,22.966-24.699,38.678-35.737c23.567-16.594,52.262-30.77,80.682-41.507c28.42-10.738,56.601-18.053,78.864-21.209 c5.608-0.797,9.776-5.6,9.776-11.269V104.489C512,101.496,510.783,98.572,508.672,96.445z M209.099,461.737 c-8.079-7.718-17.032-14.974-26.671-21.74c-25.659-18.052-55.864-32.888-85.742-44.183c-25.968-9.811-51.627-16.903-73.907-20.874 V116.238c16.208,0.892,32.245,3.542,47.956,6.81c0.788,0.171,1.595,0.24,2.419,0.232l-0.103,0.488 c32.846,6.836,62.656,19.091,86.6,35.05c22.246,14.81,39.329,32.777,49.449,52.382V461.737z M168.483,145.559 c-23.824-15.883-52.571-28.086-84.062-35.573c0-2.136,0-5.96-0.018-10.882c-0.017-15.789-0.051-42.528-0.068-58.497 c13.928,6.981,28.352,15.978,42.382,26.414c26.912,19.973,52.519,45.152,71.575,70.777c9.536,12.795,17.443,25.71,23.12,38.008 c4.682,10.146,7.804,19.854,9.244,28.695h-7.066C211.962,181.681,192.702,161.699,168.483,145.559z M286.968,476.067h-61.935 v-255.63h17.666c0.018,0,0.018,0,0.018,0h26.568c0.016,0,0.016,0,0.034,0h17.649V476.067z M288.426,204.501h-7.101 c2.023-12.4,7.427-26.551,15.66-41.173c14.184-25.273,36.551-51.876,62.021-74.773c21.766-19.613,45.847-36.516,68.676-47.965 c-0.018,8.198-0.034,19.218-0.052,30.17c-0.016,16.989-0.034,33.729-0.051,39.226c-31.474,7.487-60.221,19.69-84.062,35.573 C319.299,161.699,300.055,181.681,288.426,204.501z M489.24,374.948c-13.739,2.444-28.747,6.072-44.355,10.806 c-29.09,8.816-60.169,21.414-88.316,37.271c-14.064,7.941-27.409,16.689-39.415,26.259c-5.008,3.996-9.759,8.139-14.235,12.427 V211.199c10.119-19.604,27.202-37.571,49.448-52.382c23.927-15.96,53.737-28.215,86.6-35.05l-0.103-0.488 c0.806,0.009,1.63-0.06,2.418-0.232c15.712-3.268,31.748-5.917,47.957-6.81V374.948z" />
			</svg>
		),
	},
]

export default function Home() {
	return (
		<main className="">
			{/* Hero */}
			<div className="overflow-hidden relative min-h-[80vh] bg-slate-100 flex flex-col items-center justify-center p-5 mx-auto sm:px-28">
				{/* Silly divs for aesthetics */}
				<div className="invisible md:visible absolute rounded-full border-[8px] border-secondary -right-52 top-44 w-96 h-96"></div>
				<div className="invisible md:visible absolute rounded-full bg-primary-400 -left-44 -bottom-32 w-96 h-96"></div>
				<div className="invisible md:visible absolute left-40 top-32">
					<div className="grid grid-cols-7 gap-6">
						{[...Array.from({ length: 63 })].map((_, i) => (
							<div
								key={i}
								className="w-1 h-1 rounded-full bg-primary-400"
							></div>
						))}
					</div>
				</div>

				<section className="relative w-full max-w-7xl">
					<div className="grid grid-cols-1 gap-6 lg:gap-14 items-center">
						<div className="max-w-xl mx-auto text-center">
							<p className="max-w-xl text-base tracking-tight text-gray-600">
								رسالتنا هي إحياء التراث ونشر الوعي حول إمامنا
								زين العابدين عليه السلام، من خلال البحوث
								والأنشطة الثقافية والترويج للقيم الشيعية. نعمل
								على تطوير المحتوى الثقافي والتقني لخدمة الإسلام
								الشيعي والمساهمة في إثراء الفهم الديني والثقافي.
							</p>
						</div>
						<div className="order-first">
							<Image
								width={1500}
								height={1500}
								priority
								className="object-cover rounded-3xl object-center w-96 mx-auto bg-transparent"
								alt="hero"
								src="/logo.png"
							/>
						</div>
					</div>
				</section>
				<div className="text-center text-primary lg:mt-12 space-x-4">
					<p className="text-3xl font-bold my-8">
						تعرف على الامام زين العابدين (ع)
					</p>
					<div className="flex flex-col sm:flex-row gap-4 sm:gap-12 font-extralight">
						<Link
							href="#"
							className="bg-transparent hover:scale-105 duration-300 sm:text-lg text-xs font-bold py-2.5 px-6 rounded-full inline-flex items-center"
						>
							حياته الشريفة
						</Link>
						<Link
							href="#"
							className="bg-transparent hover:scale-105 duration-300 sm:text-lg text-xs font-bold py-2.5 px-6 rounded-full inline-flex items-center"
						>
							رسالة الحقوق
						</Link>
						<Link
							href="#"
							className="bg-transparent hover:scale-105 duration-300 sm:text-lg text-xs font-bold py-2.5 px-6 rounded-full inline-flex items-center"
						>
							الصحيفة السجادية
						</Link>
					</div>
				</div>
			</div>

			{/* sections showcase */}
			<div className="flex h-screen flex-col gap-2 my-16">
				<div className="flex flex-col justify-center items-center max-w-4xl mx-auto text-center">
					<h1 className="text-4xl font-bold tracking-tight">
						تعرف على مختلف المجالات التي تهتم بها المؤسسة
					</h1>
					<p className="leading-7 mt-6">
						تعمل مؤسستنا على العديد من الجوانب العلمية والعملية على
						حد سواء
					</p>
				</div>
				<div className="flex justify-center h-full">
					<div className="flex flex-col justify-center flex-grow items-stretch max-w-4xl w-full sm:flex-row sm:h-3/4 sm:overflow-hidden">
						{sections.map(
							(item) =>
								item && (
									<div
										key={item.title}
										className="group hover:grow-[10] hover:max-w-full cursor-pointer duration-500 ease-in-out flex-grow m-2 min-h-14 min-w-14 overflow-hidden pane relative rounded-3xl transition-all"
									>
										<div
											className={`absolute bg-center bg-cover bg-white-500 ${item.imageUrl} bg-no-repeat duration-700 ease-in-out inset-0 scale-100 transition-all z-10`}
										/>
										<div
											className={`absolute bg-gradient-to-b bottom-0 duration-700 ease-in-out from-transparent h-1/2 inset-x-0 opacity-0 group-hover:opacity-75 group-hover:translate-y-0 ${item.gradientColor} transform transition-all translate-y-1/2 z-20`}
										/>
										<div className="absolute bottom-0 duration-700 ease-in-out flex group-hover:translate-x-2 right-0 mb-2 sm:translate-x-2 ml-3 sm:mb-6 sm:mr-2 transition-all z-30">
											{item.icon}
											<div className="flex flex-col justify-center leading-tigh whitespace-pre">
												<div className="group-hover:opacity-100 text-gray-100 group-hover:translate-x-0 ease-in-out font-bold duration-700 opacity-0 relative transform transition-all -translate-x-8">
													{item.title}
												</div>
												<div className="group-hover:opacity-100 text-nowrap text-gray-300 group-hover:translate-x-0 delay-100 duration-700 ease-in-out opacity-0 relative transform transition-all -translate-x-8">
													{item.subtitle}
												</div>
											</div>
										</div>
									</div>
								),
						)}
					</div>
				</div>
			</div>

			{/* Acitivites section */}
			<div className="space-y-10">
				<div className="text-center">
					<h1 className="text-5xl font-bold">اخبار المؤسسة</h1>
					<p className="text-xl">
						تعرف على اخبار المؤسسة ونشاطاتها اليومية
					</p>
				</div>
				<div className="grid grid-cols-3 max-w-7xl mx-auto gap-10">
					{Array.from({ length: 6 }).map((_, index) => (
						<Link
							href={"#"}
							key={index}
							className="space-y-7 group p-6"
						>
							<Image
								src="/images/landscape-placeholder.svg"
								alt="some event"
								width={500}
								height={500}
								className=""
							/>
							<div>
								<h3 className="text-slate-600">الصنف</h3>
								<h2 className="font-bold">
									عنوان طويل يوصف الخبر بشكل دقيق
								</h2>
							</div>
							<button className="flex items-center text-xl group-hover:text-primary-300 duration-300">
								قراءة الخبر
								<CircleArrowLeft
									className="opacity-0 group-hover:opacity-100 group-hover:-translate-x-5 duration-300"
									stroke="rgb(124, 204, 198)"
									width={80}
									height={40}
								/>
							</button>
						</Link>
					))}
				</div>
			</div>

			{/* Publication section */}
			<div className="flex flex-col items-center gap-28 my-20">
				<div className="text-center h-1/5">
					<h1 className="text-5xl font-bold">اخبار المؤسسة</h1>
					<p className="text-xl">
						تعرف على اخبار المؤسسة ونشاطاتها اليومية
					</p>
				</div>
				<div className="flex flex-wrap justify-center gap-y-16 gap-x-6 h-4/5">
					{Array.from({ length: 4 }).map((_, index) => (
						<Link
							key={index}
							href={"#"}
							className="flex h-1/4 gap-10 text p-6 m-2 hover:bg-slate-50 shadow-lg border-[1px] border-transparent hover:border-primary-300 hover:shadow-primary-250 rounded-2xl hover:-translate-y-2 duration-300"
						>
							<Image
								src={"images/landscape-placeholder.svg"}
								alt="book cover"
								width={200}
								height={200}
								className="-translate-y-1/3 rounded-2xl"
							/>
							<div className="flex flex-col justify-around">
								<div>
									<p className="text-lg">
										مُعْجَمُ إعرابَ ألفاظِ الصَّحيفةِ
										السَّجاديَّةِ - الجزء الاول
									</p>
									<p className="text-sm text-slate-400">
										تأليف محمد جليل عباس
									</p>
								</div>
								<div className="flex justify-around text-xs text-slate-400">
									<span>200 صفحة</span>
									<span>5 اجزاء</span>
									<span>تم نشره في ربيع الاول 1445 هـ</span>
								</div>
							</div>
						</Link>
					))}
				</div>
				<button className="flex gap-10 w-fit items-center text-2xl text-primary-300 duration-150 hover:scale-105 active:scale-95  hover:shadow-primary-250 shadow-sm px-4 py-2 rounded-md ">
					قراءة المزيد
					<CircleArrowLeft
						stroke="rgb(124, 204, 198)"
						width={40}
						height={40}
					/>
				</button>
			</div>
			{/* Testimonials section */}
			<div className="h-screen flex justify-center items-center">
				<h1 className="text-xl">testimonials</h1>
			</div>
		</main>
	)
}
